Enums/бит_ТипыВариантовОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипыВариантовОтчетов</Name>
			<Comment>Типы вариантов отчетов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предопределенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользовательский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внешний</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ВариантыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипВарианта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыВариантовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеВарианта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

SettingsStorages/бит_ХранилищеВариантовОтчетов/Forms/ФормаЗагрузкиУправляемая/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем КлючТекущихНастроек;
	
	КлючОбъекта = Параметры.КлючОбъекта;	
	КлючТекущихНастроек = Параметры.КлючТекущихНастроек;		
	
	// Список предопределённых
	СтандартныеВарианты = Параметры.СтандартныеНастройки; 
	
	ОбновитьТаблицуВариантов(КлючТекущихНастроек);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаСохраненныеВариантыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьВариант();
	
КонецПроцедуры // ТаблицаСохраненныеВариантыВыбор()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ВыбратьВариант();
	
КонецПроцедуры // КомандаВыбрать()

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОбновитьТаблицуВариантов();
	
КонецПроцедуры // КомандаОбновить()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Клиент

&НаКлиенте
Процедура ВыбратьВариант()
	
	ТекущиеДанные = Элементы.ТаблицаСохраненныеВарианты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Закрыть();
		
	Иначе
		
		ТекКлюч = ТекущиеДанные.КлючВарианта;
		
		ВыборВарианта = Новый ВыборНастроек(ТекКлюч);
		Закрыть(ВыборВарианта);
		
	КонецЕсли; 
	
КонецПроцедуры // ВыбратьВариант()

////////////////////////////////////////////////////////////////////////////////
// Сервер

&НаСервере
Процедура ОбновитьТаблицуВариантов(КлючТекущихНастроек = Неопределено)
	
	ИдТекущейСтроки = Неопределено;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("КлючОбъекта", КлючОбъекта);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ВариантыОтчетов.Ссылка,
	|	бит_ВариантыОтчетов.Наименование,
	|	бит_ВариантыОтчетов.ИспользоватьПриОткрытии,
	|	бит_ВариантыОтчетов.Ответственный,
	|	бит_ВариантыОтчетов.КлючВарианта,
	|	бит_ВариантыОтчетов.ТипВарианта
	|ИЗ
	|	Справочник.бит_ВариантыОтчетов КАК бит_ВариантыОтчетов
	|ГДЕ
	|	бит_ВариантыОтчетов.КлючОбъекта = &КлючОбъекта
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_ВариантыОтчетов.Наименование
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	ТаблицаСохраненныеВарианты.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		// БИТ_ЖКХ 21.01.2015{{
		Если Выборка.Ответственный = ПредопределенноеЗначение("Справочник.ГруппыПользователей.ВсеПользователи") 
			или	Выборка.Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь") Тогда
			
			НоваяСтрока = ТаблицаСохраненныеВарианты.Добавить();
			НоваяСтрока.СохраненныйВариант      = Выборка.Ссылка;
			НоваяСтрока.КлючВарианта            = Выборка.КлючВарианта;
			НоваяСтрока.Ответственный           = Выборка.Ответственный;
			НоваяСтрока.ИспользоватьПриОткрытии = Выборка.ИспользоватьПриОткрытии;
			
			Если Выборка.ТипВарианта = Перечисления.бит_ТипыВариантовОтчетов.Предопределенный Тогда
				НоваяСтрока.ЭтоПредопределенный  = Истина;
				СтандартныйВар = СтандартныеВарианты.НайтиПоЗначению(Выборка.КлючВарианта);
				Если СтандартныйВар <> Неопределено Тогда
					НоваяСтрока.Представление = СтандартныйВар.Представление;
				Иначе 
					НоваяСтрока.Представление =  Выборка.Наименование;
				КонецЕсли; 
			Иначе
				НоваяСтрока.Представление =  Выборка.Наименование;
			КонецЕсли;
			
			Если КлючТекущихНастроек = Выборка.КлючВарианта Тогда
				ИдТекущейСтроки = НоваяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		// БИТ_ЖКХ 21.01.2015}}
		
	КонецЦикла;
	
	Если ИдТекущейСтроки <> Неопределено Тогда
		Элементы.ТаблицаСохраненныеВарианты.ТекущаяСтрока = ИдТекущейСтроки;
	КонецЕсли;
	
КонецПроцедуры // ОбновитьТаблицуВариантов()

#КонецОбласти
